<!-- dflook/terraform-github-actions {"workspace":"dev","backend_type":"s3","label":"dev","backend":"6dba5770293767dc73e4fd552ecd93e8863929cd939215a00af9843156ca5074","plan_job_ref":"Job CICD for Splitrr Infra #31 at https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10655789650","plan_out_hash":"2c6c0379ac850e96115d7b4366c8b7ddf36bcebc55d6273ffef5fa3f30270fb7","plan_hash":"40ea80fdafc47a2cdd90f0e1516f2477af8e44fdf91b63be62da4fb640d7bcb2","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan for __dev__
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.cognito.aws_cognito_identity_pool.identity_pool will be created
+   resource "aws_cognito_identity_pool" "identity_pool" {
+       allow_classic_flow               = false
+       allow_unauthenticated_identities = false
+       arn                              = (known after apply)
+       id                               = (known after apply)
+       identity_pool_name               = "splitrr-dev-load-balancer-identity-pool"
+       tags_all                         = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }

+       cognito_identity_providers {
+           client_id               = (known after apply)
+           provider_name           = (known after apply)
+           server_side_token_check = false
        }
    }

  # module.cognito.aws_cognito_user_pool.user_pool will be created
+   resource "aws_cognito_user_pool" "user_pool" {
+       arn                        = (known after apply)
+       auto_verified_attributes   = [
+           "email",
        ]
+       creation_date              = (known after apply)
+       custom_domain              = (known after apply)
+       deletion_protection        = "INACTIVE"
+       domain                     = (known after apply)
+       email_verification_message = (known after apply)
+       email_verification_subject = (known after apply)
+       endpoint                   = (known after apply)
+       estimated_number_of_users  = (known after apply)
+       id                         = (known after apply)
+       last_modified_date         = (known after apply)
+       mfa_configuration          = "OFF"
+       name                       = "splitrr-dev-load-balancer-user-pool"
+       sms_verification_message   = (known after apply)
+       tags                       = {
+           "Name" = "gaurab-user-pool"
        }
+       tags_all                   = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "gaurab-user-pool"
+           "Project" = "Splitrr"
        }

+       account_recovery_setting {
+           recovery_mechanism {
+               name     = "verified_email"
+               priority = 1
            }
+           recovery_mechanism {
+               name     = "verified_phone_number"
+               priority = 2
            }
        }

+       admin_create_user_config {
+           allow_admin_create_user_only = false
        }

+       password_policy {
+           minimum_length                   = 8
+           require_lowercase                = true
+           require_numbers                  = true
+           require_symbols                  = true
+           require_uppercase                = true
+           temporary_password_validity_days = (known after apply)
        }

+       sms_configuration (known after apply)

+       verification_message_template (known after apply)
    }

  # module.cognito.aws_cognito_user_pool_client.user_pool_client will be created
+   resource "aws_cognito_user_pool_client" "user_pool_client" {
+       access_token_validity                         = (known after apply)
+       allowed_oauth_flows                           = (known after apply)
+       allowed_oauth_flows_user_pool_client          = (known after apply)
+       allowed_oauth_scopes                          = (known after apply)
+       auth_session_validity                         = (known after apply)
+       callback_urls                                 = (known after apply)
+       client_secret                                 = (sensitive value)
+       default_redirect_uri                          = (known after apply)
+       enable_propagate_additional_user_context_data = (known after apply)
+       enable_token_revocation                       = (known after apply)
+       explicit_auth_flows                           = [
+           "ALLOW_CUSTOM_AUTH",
+           "ALLOW_REFRESH_TOKEN_AUTH",
+           "ALLOW_USER_PASSWORD_AUTH",
+           "ALLOW_USER_SRP_AUTH",
        ]
+       generate_secret                               = false
+       id                                            = (known after apply)
+       id_token_validity                             = (known after apply)
+       logout_urls                                   = (known after apply)
+       name                                          = "splitrr-dev-load-balancer-user-pool-client"
+       prevent_user_existence_errors                 = (known after apply)
+       read_attributes                               = (known after apply)
+       refresh_token_validity                        = (known after apply)
+       supported_identity_providers                  = (known after apply)
+       user_pool_id                                  = (known after apply)
+       write_attributes                              = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [CICD for Splitrr Infra #31](https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10655789650)